Repository: vale21/mac-mulator
Catalog: MacMulator/UI/*.lproj/Localizable.strings
Languages: it

# AppDelegate.exportToParallelsComplete
source: Export to Parallels complete.
it: Esportazione completata.

# AppDelegate.exportToParallelsFailed
source: Export failed with error: %@
it: Esportazione fallita con errore: %@

# AppDelegate.importFromParallelsFailed
source: Import failed with error: %@
it: Importazione fallita con errore: %@

# AppDelegate.youHaveRunningVMs
source: You have running VMs. Closing MacMulator will forcibly kill any running VM. It is strogly suggested to shut them down gracefully using the guest OS shut down procedure, or you might loose your unsaved work. Do you want to continue?
it: Ci sono VM in esecuzione. Chiudendo MacMulator forzerai la terminazione di ciascuna. É fortemente raccomandato che siano spente correttamente, utilizzando la procedura di spegnimento nel sistema operativo guest, altrimenti potresti perdere il lavoro non salvato. Vuoi continuare?

# AppDelegate.cannotOpenFile
source: Could not open file %@. It migh be corrupted.
it: Non ho potuto aprire il file %@. Potrebbe essere corrotto.

# AppDelegate.errorDeleting
source: Error while deleting %@: %@
it: Errore durante la cancellazione di %@: %@

# AppDelegate.errorReading
source: Error while reading %@: %@
it: Errore durante la lettura di %@: %@

# AppDelegate.couldNotFindExistingVMs
source: Could not find some Virtual Machines that were configured in MacMulator: %@
it: Le seguenti VM che erano configurate in MacMulator non sono state trovate: %@

# AppDelegate.exportFailed
source: Export failed with error: %@
it: Esportazione fallita con il seguente errore: %@

# AppDelegate.importFailed
source: Import failed with error: %@
it: Importazione fallita con il seguente errore: %@

# ConsoleViewController.vmNotRunning
source: Current VM is not running
it: la VM corrente non è in esecuzione

# CreateVMFileViewController.preparingDownload
source: Preparing to download macOS Installer...
it: Preparo il download dell'installer di macOS...

# CreateVMFileViewController.timeRemainingCalculating
source: Estimate time remaining: Calculating...
it: Tempo stimato rimanente: Calcolo...

# CreateVMFileViewController.creatingVM
source: Creating Virtual Machine...
it: Creo la Macchina Virtuale...

# CreateVMFileViewController.downloading
source: Downloading macOS Installer (%d%%)...
it: Download dell'installer di macOS (%d%%)...

# CreateVMFileViewController.estimateTimeRemaining
source: Estimate time remaining: %@
it: Tempo stimato rimanente: %@

# CreateVMFileViewController.unableToCreate
source: Unable to create Virtual Machine %@: %@
it: Impossibile creare la Macchina Virtuale %@: %@

# EditVMViewControllerAdvanced.featureNotAvailable
source: This feature is not available because the VM has architecture %@, which is different from the architecture of your Mac (%@)
it: Questa funzione non è disponibile perché la VM ha architettura %@, che è diversa dall'achitettura del tuo Mac (%@)

# EditVMViewControllerAdvanced.rosettaNotAvailable
source: This feature is not available because MacMulator is running under Rosetta
it: Questa funzione non è disponibile perché MacMulator sta girando sotto Rosetta

# EditVMViewControllerHardware.imageAlreadyLoaded
source: You already have configured image at path "%@" to be loaded in MacMulator.
it: Hai già configurato l'immagine al percorso "%@" per essere caricata in MacMulator.

# EditVMViewControllerHardware.confirmDeleteDrive
source: Are you sure you want to remove Virtual Drive "%@"? This operation is not reversible.
it: Sei sicuro di voler rimuovere il drive virtuale "%@"? Questa operazione è irreversibile.

# EditVMViewControllerHardware.onlyOneDriveAvailable
source: This Virtual Machine is based on Apple Virtualization Framework. With this type of Virtual Machines only one drive can be used at the moment.
it: Questa macchina virtuale è basata su Apple Virtualization Framework. Con questo tipo di macchine virtuali al momento è possibile configurare un solo drive virtuale.

# MacOSVirtualMachineDelegate.stoppedWithError
source: Virtual machine did stop with error: %@
it: La Macchina Virtuale è uscita con errore: %@

# MacOSVirtualMachineDelegate.stoppedByGuest
source: Guest did stop virtual machine.
it: La Macchina Virtuale è stata fermata dal SO guest.

# NewDiskViewController.cowNotSupported
source: This Virtual Machine is based on Apple Virtualization Framework. With this type of Virtual Machines Copy On Write is not yet supported.
it: Questa macchina virtuale è basata su Apple Virtualization Framework. Con questo tipo di macchine virtuali Copy On Write non è supportato.

# NewDiskViewController.createDisk
source: Create new disk
it: Crea nuovo disco

# NewDiskViewController.editDisk
source: Edit %@
it: Modifica %@

# NewPortMappingViewController.createMapping
source: Create new port mapping
it: Crea nuova mappatura porte

# NewPortMappingViewController.editMapping
source: Edit port mapping %@
it: Modifica mappatura %@

# NewVMViewController.defaultMessage
source: You can type here to write a description of your VM...
it: Puoi digitare qui per aggiungere una descrizione della macchina virtuale...

# NewVMController.noMediaProvided
source: You did not specify an install media for macOS. MacMulator will download the latest supported version of macOS from Apple now. Do you agree?
it: Non hai specificato un installer di macOS. MacMulator scaricherà l'ultima versione supportata di macOS da Apple. Sei d'accordo?

# NewVMController.vmCreationFailed
source: VM creation failed:
it: Creazione della VM fallita:

# NewVMController.errorFeldsMissing
source: You did not provide values for VM type or VM name. These fields are required to create a new Virtual Machine. Please provide a value for them and try again.
it: Non hai fornito un valore per Nome VM o Tipo VM. Questi campi sono nesessari per creare una Macchina Virtuale. Per favore fornisci un valore per entrambi e riprova.

# NewVMController.errorVMExisting
source: A Virtual Machine called %@ already exists. Please choose a different name.
it: Una VM chiamata %@ esiste già. Per favore, scegli un nome diverso.

# NewVMController.errorFileExisting
source: A file called %@ already exists. Please choose a different name for the Virtual Machine.
it: Un file chiamato %@ esiste già. Per favore, scegli un nome diverso per la macchina virtuale.

# PreferencesViewController.updateLivePreview
source: Update Live Preview every: (%@ seconds)
it: Aggiorna la preview live ogni: (%@ secondi)

# PreferencesViewController.pathDoesNotExists
source: Attention. Folder %@ does not exist.
it: Attenzione. La cartella %@ non esiste.

# PreferencesViewController.noQemuFound
source: No Qemu detected. Will just use bundled qemu-img to manage disk images
it: Nessun Qemu trovato. Verrà usata la versione bundle di qemu-img per gestire le immagini dosco.

# PreferencesViewController.qemuFound
source: Detected Qemu version %@
it: Trovato Qemu versione %@

# QemuConstants.hd
source: Hard Drive
it: Disco Rigido

# QemuConstants.usb
source: USB Drive
it: Drive USB

# QemuConstants.ipsw
source: IPSW Install Image
it: Immagine di installazione IPSW

# QemuConstants.efi
source: EFI Firmware
it: Firmware EFI

# QemuConstants.nvme
source: NVMe Drive
it: Drive NVMe

# QemuConstants.other
source: Other
it: Altro

# QemuConstants.macos
source: Generic macOS
it: macOS Generico

# QemuConstants.windows
source: Generic Windows
it: Windows Generico

# QemuConstants.linux
source: Generic Linux
it: Linux Generico

# QemuConstants.ios
source: Generic iOS
it: iOS Generico

# QemuConstants.generic
source: Generic VM
it: VM Generica

# QemuConstants.x64
source: Generic x86_64 VM
it: VM Generica x86_64

# QemuConstants.x86
source: Generic x86 VM
it: VM Generica x86

# QemuConstants.arm64
source: Generic ARM 64 VM
it: VM Generica ARM 64

# QemuConstants.arm
source: Generic ARM VM
it: VM Generica ARM

# QemuConstants.ppc64
source: Generic PowerPc 64 VM
it: VM Generica PowerPc 64

# QemuConstants.ppc
source: Generic PowerPc VM
it: VM Generica PowerPc

# QemuConstants.riscv64
source: Generic RISC-V 64 VM
it: VM Generica RISC-V 64

# QemuConstants.riscv
source: Generic RISC-V VM
it: VM Generica RISC-V

# QemuConstants.m68k
source: Generic Motorola 68k VM
it: VM Generica Motorola 68k

# Utils.sudoNotAllowed
source: Incorrect Qemu command provided: The usage of sudo command is not allowed.
it: Il comando Qemu fornito è errato: L'uso del comando sudo non è consentito.

# Utils.workingPathError
source: Incorrect Qemu command provided: The provided executable does not run in the correct path. Expected path is: "%@". Provided command was: %@
it: Il comando Qemu fornito è errato: L'eseguibile fornito non punta alla directory corretta. La directoiry attesa è: "%@". Il comando fornito è: %@

# Utils.executableError
source: Incorrect Qemu command provided: The provided executable Is not a Qemu Executable. Allowed executables are: %@. Provided command was: %@
it: Il comando Qemu fornito è errato: L'eseguibile fornito non è un esegfuibile Qemu. Gli eseguibili consentiti sono: %@. Il comando fornito è: %@

# Utils.genericError
source: The provided Qemu executable is broken or unsupported
it: L'eseguibile Qemu fornito è corrotto o non supportato.

# Utils.calcel
source: Cancel
it: Annulla

# Utils.hostArchitectureNotGood
source: The VM cannot be started because it is an %@ VM and cannot run on an %@ Mac.
it: La VM non può essere avviata perché è una VM %@ VM e non può essere eseguita su un Mac %@.

# Utils.appleSiliconOnly
source: The VM cannot be started because it can run only on Apple Silicon hardware.
it: La VM non può essere avviata perché funziona solo su hardware Apple Silicon.

# Utils.virtualizationNotSupported
source: The VM cannot be started because Apple Virtualization Framework is not supported with this VM.
it: La VM non può essere avviata perché Apple Virtualization Framework non è supportato su questa VM.

# Utils.virtualizationBigSur
source: The VM cannot be started because Apple Virtualization Framework is not supported on macOS Big Sur.
it: La VM non può essere avviata perché Apple Virtualization Framework non è supportato su macOS Big Sur.

# Utils.virtualizationCatalina
source: The VM cannot be started because Apple Virtualization Framework is not supported on macOS Catalina.
it: La VM non può essere avviata perché Apple Virtualization Framework non è supportato su macOS Catalina.

# Utils.virtualizationMojave
source: The VM cannot be started because Apple Virtualization Framework is not supported on macOS Mojave.
it: La VM non può essere avviata perché Apple Virtualization Framework non è supportato su macOS Mojave.

# Utils.virtualizationHighSierra
source: The VM cannot be started because Apple Virtualization Framework is not supported on macOS High Sierra.
it: La VM non può essere avviata perché Apple Virtualization Framework non è supportato su macOS High Sierra.

# Utils.virtualizationGeneric
source: The VM cannot be started because Apple Virtualization Framework is not supported on this Mac.
it: La VM non può essere avviata perché Apple Virtualization Framework non è supportato su questo Mac.

# Utils.hour
source: hour
it: ora

# Utils.hours
source: hours
it: ore

# Utils.minute
source: minute
it: minuto

# Utils.minutes
source: minutes
it: minuti

# Utils.second
source: second
it: secondo

# Utils.seconds
source: seconds
it: secondi

# Utils.lessThanAMinute
source: less than a minute
it: meno di un minuto

# Utils.unexistingDrive
source: Drive %@ was not found. Do you want to remove it?
it: Il disco %@ non è stato trovato. Lo vuoi rimuovere?

# Utils.macMainScreen
source: %d x %d (Mac Main Screen)
it: %d x %d (Schermo Mac)

# Utils.lastUsed
source: %d x %d (Last used)
it: %d x %d (Ultima utilizzata)

# VirtualizationFrameworkInstallVMViewController.installing
source: Installing macOS on the Virtual Machine. The process will start in a few seconds...
it: Installo macOS sulla Macchina Virtuale. La procedura inizierà tra pochi secondi...

# VirtualizationFrameworkInstallVMViewController.timeRemainingCalculating
source: Estimate time remaining: Calculating...
it: Tempo stimato rimanente: Calcolo...

# VirtualizationFrameworkInstallVMViewController.starting
source: Starting installation.
it: Avvio l'installazione.

# VirtualizationFrameworkInstallVMViewController.installFailed
source: Installation failed with error: %@
it: Installazione fallita con errore: %@

# VirtualizationFrameworkInstallVMViewController.installSucceeded
source: Installation succeeded.
it: Installazione completata con successo.

# VirtualizationFrameworkInstallVMViewController.installProgress
source: Installation progress: %f%%
it: Installazione: %f%%

# VirtualizationFrameworkInstallVMViewController.installAbort
source: Aborting installation. Please wait...
it: Annullo l'installazione. Per favore attendi...

# VirtualizationFrameworkInstallVMViewController.installProgressLong
source: Installing macOS on the Virtual Machine (%d%%)...
it: Installo macOS sulla Macchina Virtuale (%d%%)...

# VirtualizationFrameworkInstallVMViewController.estimateTimeRemaining
source: Estimate time remaining: %@
it: Tempo stimato rimanente: %@

# VirtualizationFrameworkPauseResumeVMViewController.pausing
source: Pausing VM and saving state...
it: Metto in pausa la VM e salvo lo stato...

# VirtualizationFrameworkPauseResumeVMViewController.resuming
source: Resuming VM from saved state...
it: Recupero la VM dallo stato salvato...

# VirtualMachine.sshPortMapping
source: SSH port mapping
it: Mappatura SSH

# VirtualMachine.infoPlistReadError
source: Error while reading Info.plist: %@
it: Errore nella lettura di Info.plist: %@

# VirtualMachine.infoPlistWriteError
source: Error while writing Info.plist: %@
it: Errore nella scrittura di Info.plist: %@

# VirtualMachineListViewController.delete
source: Delete
it: Elimina

# VirtualMachineListViewController.edit
source: Edit
it: Modifica

# VirtualMachineListViewController.start
source: Start
it: Avvia

# VirtualMachineListViewController.startInRecovery
source: Start in Recovery Mode
it: Avvia in modalità di recupero

# VirtualMachineListViewController.stop
source: Stop
it: Arresta

# VirtualMachineListViewController.pause
source: Pause
it: Pausa

# VirtualMachineListViewController.showInFinder
source: Show in Finder
it: Mostra nel Finder

# VirtualMachineListViewController.clone
source: Clone
it: Clona

# VirtualMachineViewController.forciblyClosing
source: Attention. This operation will forcibly kill the running VM. It is strogly suggested to shut it down gracefully using the guest OS shuit down procedure, or you might loose your unsaved work. Do you want to continue?
it: Attenzione. Questa operazione causerà la chiusura forzata della VM in esecuzione. Suggerimao di terminarla correttamente, utilizzando la procedura di spegnimento del sistema operativo, o potresti perdere i dati non salvati. Vuoi continuare?

# VirtualMachineViewController.startVM
source: Start this VM
it: Avvia questa VM

# VirtualMachineViewController.pauseNotSupported
source: Pause feature is supported only for Apple Silicon macOS Guests
it: La pausa è supportata solo da VM Apple Silicon con guest macOS

# VirtualMachineViewController.pauseVM
source: Pause this VM
it: Metti in pausa questa VM

# VirtualMachineViewController.stopVM
source: Stop the execution of this VM
it: Arresta l'esecuzione di questa VM

# VirtualMachineViewController.pausedVMName
source: %@ (Paused)
it: %@ (In pausa)

# VirtualMachineViewController.notSpecified
source: Not specified
it: Non specificato

# VirtualMachineViewController.binaryNotAvaiable
source: The VM cannot be started because Qemu binary for artchitecture %@ is not available.
it: La VM non può essere avviata perché l'eseguibile QEMU per l'architettura %@ non è disponibile.

# VirtualMachineViewController.vmPaused
source: VM paused
it: VM in pausa

# VirtualMachineViewController.vmFeatures
source: Virtual Machine Features
it: Caratteristiche Macchina Virtuale

# VirtualMachineViewController.vmExecutionFailed
source: VM execution failed with error: %@
it: L'esecuzione della VM è fallita con questo errore: %@
